occDrivAerStaticMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        // Single-level Krylov cannot converge the 65M-cell pressure Poisson:
        // Jacobi-CG diverged at step ~7, Schwarz(Ic)-CG diverged at step 1
        // (non-SPD preconditioner), and BiCGStab+DIC only cut the residual ~17%
        // in 1500 iters. Use a Ginkgo scale-corrected algebraic multigrid (Pgm
        // coarsening) V-cycle preconditioned Fcg via configFile. Path must be
        // UNQUOTED so the OpenFOAM tokenizer keeps it as a single word; the
        // configFile carries the full Ginkgo config (solver, preconditioner and
        // stopping criteria), so no other keys are read for this field.
        // Requires the scale-corrected Ginkgo (NeoN_GINKGO_TAG b17780da8b,
        // branch reuse_pgm_update_rebase) which adds solver::Ir scale_correction.
        //configFile        system/gko/p-multigrid.json;
        solver           PCG;
        preconditioner   diagonal;
	tolerance       1e-7;
	relTol          0.01;
        l1ScaledResidual true;
	maxIter 3000;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        l1ScaledResidual true;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        l1ScaledResidual true;
    }

    omega
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        l1ScaledResidual true;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
