occDrivAerStaticMesh/system/calc_cp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

calc_cp
{
    // Mandatory entries (unmodifiable)
    type            pressure;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    mode            staticCoeff;
    result          cp;

    // Optional entries (runtime modifiable)
    p               p;
    U               U;
    pInf            $pref;
    UInf            $Uinf;
    rho             rhoInf; 
    rhoInf          1;
    writeControl    writeTime;
}

// ************************************************************************* //
