occDrivAerStaticMesh/system/include/caseDefinition
// Geometric parameters
lref       2.78618;                        // Reference length/wheelbase (in m)
Aref       2.17;                           // Reference area (in m^2) - frontal area

// Patch assignment:
inletPatch                  inlet;
outletPatch                 outlet;
slipGroundPatch             ground;
fixedWallPatches            "(Body.*|Closed.*|CTRL.*|Engine.*|Exhaust.*|Mirror.*|Notchback.*|OCDA.*|Powertrain|Wheel.*|Rims.*|Brake.*|Tires.*|Plinth.*|ground_noSlip.*)";
symmPatches                 freestream;
forcesWallPatches           "(Body.*|Closed.*|CTRL.*|Engine.*|Exhaust.*|Mirror.*|Notchback.*|OCDA.*|Powertrain|Wheel.*|Rimsfront|BrakeDiscfront|Tiresfront|Rimsrear|BrakeDiscrear|Tiresrear|Rimsfront_rota|Rimsrear_rota|BrakeDiscfront_rota|BrakeDiscrear_rota)";

// Inlet and boundary conditions:
Uinf                (38.889 0 0);    // Reference velocity vector at inlet (in m/s)
UinfMag             38.889;          // Reference velocity magnitude at inlet (in m/s)
// DIAGNOSTIC (laminar stability test): nu raised 1e5x -> Re ~72 (physical air value
// is 1.507e-05, Re ~7.2e6). At Re~72 the flow is attached/creeping and a steady
// laminar solution unambiguously exists, so this is decisive: converges => numerics
// are sound and the high-Re divergence is laminar/high-Re physics; still diverges =>
// a real numerical bug in the pressure-velocity coupling. Revert to 1.507e-05 after.
// (nu 1.507e-02 -> Re~7.2e3 only delayed the blow-up: step 6 -> ~step 14.)
nu                  1.507e+00;       // Reference kinematic viscosity (in m^2/s) - DIAGNOSTIC (1e5x air)
pref                0.0;             // Reference pressure at outlet (in m^2/s^2)
viscRatio           5.0;             // Turbulent viscosity ratio in domain
Tu                  0.0026;          // Turbulence intensity in domain

// Turbulence model:
RASturbModel        kOmegaSST;       // Model for RANS simulations if used

// Simulation parameters:
nCores              512;              // Number of cores used for simulation
decompositionMethod hierarchical;    // Decomposition method
nHierarchical       (16 8 4);         // Coefficient n for the hierarchical decomposition method

// Probe settings:
interpScheme cellPatchConstrained;
probeField   cp;

