occDrivAerStaticMesh/system/probes/probes_602
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v1912
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

probes_602
{
    type            patchProbes;
    libs            ("libsampling.so");

    // Name of the directory for probe data
    name            probes_602;

    patches         ($forcesWallPatches); 

    // Write at same frequency as fields
    writeControl    timeStep;
    writeInterval   1;

    // Fields to be probed
    fields          ($probeField);

    // Optional: do not recalculate cells if mesh moves
    fixedLocations  true;

    // Optional: interpolation scheme to use (default is cell)
    interpolationScheme $interpScheme; 
    
    probeLocations
    (
        ( 1.1 -0.68175 0.875 )
        ( 1.3 -0.63023 0.975 )
        ( 1.1 -0.72363 0.775 )
        ( 1.3 -0.68185 0.875 )
        ( 1.1 -0.76153 0.675 )
        ( 1.3 -0.76635 0.675 )
        ( 1.3 -0.7288 0.775 )
        ( 1.5 -0.76913 0.675 )
        ( 1.5 -0.73185 0.775 )
        ( 1.5 -0.6852 0.875 )
        ( 1.5 -0.62805 0.975 )
    );

    // Optional: filter out points that haven't been found. Default
    //           is to include them (with value -VGREAT)
    includeOutOfBounds  true;
}
// ************************************************************************* //
