occDrivAerStaticMesh/system/probes/probes_610
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v1912
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

probes_610
{
    type            patchProbes;
    libs            ("libsampling.so");

    // Name of the directory for probe data
    name            probes_610;
   
    patches         ($forcesWallPatches);

    // Write at same frequency as fields
    writeControl    timeStep;
    writeInterval   1;

    // Fields to be probed
    fields          ($probeField);

    // Optional: do not recalculate cells if mesh moves
    fixedLocations  true;

    // Optional: interpolation scheme to use (default is cell)
    interpolationScheme $interpScheme; //cell

    probeLocations
    (
        ( -0.8048 0 -0.103 )
        ( 3.7993 0 0.15 )
        ( -0.7248 0 0.3841 )
    );

    // Optional: filter out points that haven't been found. Default
    //           is to include them (with value -VGREAT)
    includeOutOfBounds  true;
}
// ************************************************************************* //
