occDrivAerStaticMesh/system/probes/probes_612
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v1912
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

probes_612
{
    type            patchProbes;
    libs            ("libsampling.so");

    // Name of the directory for probe data
    name            probes_612;

    patches         ($forcesWallPatches);   

    // Write at same frequency as fields
    writeControl    timeStep;
    writeInterval   1;

    // Fields to be probed
    fields          ($probeField);

    // Optional: do not recalculate cells if mesh moves
    fixedLocations  true;

    // Optional: interpolation scheme to use (default is cell)
    interpolationScheme $interpScheme; //cell

    probeLocations
    (
        ( 1.02 -0.759 0.675 )
        ( 1.02 -0.7411 0.725 )
        ( 1.02 -0.7209 0.775 )
        ( 1.1 -0.6988 0.83 )
        ( 1.2 -0.6767 0.88 )
        ( 1.3 -0.6545 0.925 )
        ( 1.4 -0.6418 0.95 )
        ( 1.2 -0.7065 0.82 )
        ( 1.2 -0.7244 0.78 )
        ( 1.4 -0.6812 0.88 )
        ( 1.4 -0.7285 0.78 )
    );

    // Optional: filter out points that haven't been found. Default
    //           is to include them (with value -VGREAT)
    includeOutOfBounds  true;
}
// ************************************************************************* //
